function p = predict(theta, X)

% Предсказать, будет ли метка 0 или 1, используя изученную логистику
% регрессии параметров тета
% p = PREDICT(theta, X) вычисляет прогнозы для X, используя
% порог 0,5 (т. е. если sigmoid(theta'*x) >= 0.5 , прогноз 1)

m = size(X, 1); % Number of training examples

% You need to return the following variables correctly
p = zeros(m, 1);

% ====================== YOUR CODE HERE ======================
% Инструкции: выполните следующий код, чтобы делать прогнозы, используя
% ваших изученных параметров логистической регрессии.
% Вы должны установить `p` для вектора 0 и 1
%

  p = round(sigmoid(X * theta));
  % или
  % p=(sigmoid(X*theta)>=0.5);

 % для одного if sigmoid(theta'.*X) >= 0.5, p=1; else p=0; endif;

 
% =========================================================================
#{

 [1 2 3;1 2 3]*[2;3;4]
ans =

   20
   20

  [2;3;4]'.*[1 2 3;1 2 3]
ans =

    2    6   12
    2    6   12

#}

end
